# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew "doctl"
brew "libogg"
brew "flac"
brew "giflib"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "xvid"
brew "ffmpeg"


# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Kubernetes
brew 'kubernetes-cli'


# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'screenflow'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'DemoRemote', id: 1457425673
mas 'Amphetamine', id: 937984704
mas 'The Unarchiver', id: 425424353
mas 'Copied', id: 1026349850
mas 'WireGuard', id: 1451685025
mas 'Xcode', id: 497799835
mas 'SnippetsLab', id: 1006087419
mas 'Pixelmator Pro', id: 1289583905
